#+title: Porting data from dump

* Users

Old schema:

#+begin_src sql
-- ----------------------------
-- Table structure for membership
-- ----------------------------
CREATE TABLE `membership` (
  `memberID` int(11) NOT NULL AUTO_INCREMENT,
  `nameLast` varchar(100) DEFAULT NULL,
  `nameFirst` varchar(100) DEFAULT NULL,
  `address1` varchar(200) DEFAULT NULL,
  `address2` varchar(200) DEFAULT NULL,
  `city` varchar(200) DEFAULT NULL,
  `province` varchar(20) DEFAULT NULL,
  `country` varchar(100) DEFAULT 'Canada',
  `postalCode` varchar(20) DEFAULT NULL,
  `telephone` varchar(20) DEFAULT NULL,
  `cell` varchar(20) DEFAULT NULL,
  `email` varchar(200) DEFAULT NULL,
  `status` varchar(20) NOT NULL DEFAULT 'New',
  `master_age` varchar(10) DEFAULT 'no',
  `master_firstDate` varchar(20) DEFAULT NULL,
  `dateAdded` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `siteCode` varchar(20) DEFAULT 'Member',
  `login` varchar(200) DEFAULT NULL,
  `password` varchar(30) DEFAULT NULL,
  `class` varchar(20) DEFAULT NULL COMMENT 'blank,open,masters,amateurs,womens',
  `region` varchar(50) DEFAULT NULL,
  `height` varchar(50) DEFAULT NULL,
  `weight` varchar(50) DEFAULT NULL,
  `birthDate` varchar(20) DEFAULT NULL,
  `tartan` varchar(100) DEFAULT NULL,
  `biography` longtext,
  `imageFile` varchar(200) DEFAULT NULL,
  `gamesList` varchar(100) DEFAULT NULL,
  `username` varchar(30) DEFAULT NULL,
  `banned_startDate` varchar(20) DEFAULT NULL,
  `banned_endDate` varchar(20) DEFAULT NULL,
  PRIMARY KEY (`memberID`),
  KEY `firstName` (`nameFirst`),
  KEY `lastName` (`nameLast`)
) ENGINE=MyISAM AUTO_INCREMENT=1613 DEFAULT CHARSET=latin1 ROW_FORMAT=DYNAMIC;
#+end_src

#+begin_src sql :engine mysql :dbhost localhost :dbport 3306 :dbuser root :dbpassword foobar :database csaf_dump
describe membership;
#+end_src

#+RESULTS:
| Field            | Type         | Null | Key | Default           | Extra             |
|------------------+--------------+------+-----+-------------------+-------------------|
| memberID         | int          | NO   | PRI | NULL              | auto_increment    |
| nameLast         | varchar(100) | YES  | MUL | NULL              |                   |
| nameFirst        | varchar(100) | YES  | MUL | NULL              |                   |
| address1         | varchar(200) | YES  |     | NULL              |                   |
| address2         | varchar(200) | YES  |     | NULL              |                   |
| city             | varchar(200) | YES  |     | NULL              |                   |
| province         | varchar(20)  | YES  |     | NULL              |                   |
| country          | varchar(100) | YES  |     | Canada            |                   |
| postalCode       | varchar(20)  | YES  |     | NULL              |                   |
| telephone        | varchar(20)  | YES  |     | NULL              |                   |
| cell             | varchar(20)  | YES  |     | NULL              |                   |
| email            | varchar(200) | YES  |     | NULL              |                   |
| status           | varchar(20)  | NO   |     | New               |                   |
| master_age       | varchar(10)  | YES  |     | no                |                   |
| master_firstDate | varchar(20)  | YES  |     | NULL              |                   |
| dateAdded        | timestamp    | NO   |     | CURRENT_TIMESTAMP | DEFAULT_GENERATED |
| siteCode         | varchar(20)  | YES  |     | Member            |                   |
| login            | varchar(200) | YES  |     | NULL              |                   |
| password         | varchar(30)  | YES  |     | NULL              |                   |
| class            | varchar(20)  | YES  |     | NULL              |                   |
| region           | varchar(50)  | YES  |     | NULL              |                   |
| height           | varchar(50)  | YES  |     | NULL              |                   |
| weight           | varchar(50)  | YES  |     | NULL              |                   |
| birthDate        | varchar(20)  | YES  |     | NULL              |                   |
| tartan           | varchar(100) | YES  |     | NULL              |                   |
| biography        | longtext     | YES  |     | NULL              |                   |
| imageFile        | varchar(200) | YES  |     | NULL              |                   |
| gamesList        | varchar(100) | YES  |     | NULL              |                   |
| username         | varchar(30)  | YES  |     | NULL              |                   |
| banned_startDate | varchar(20)  | YES  |     | NULL              |                   |
| banned_endDate   | varchar(20)  | YES  |     | NULL              |                   |

#+begin_src sql :engine mysql :dbhost localhost :dbport 3306 :dbuser root :dbpassword foobar :database csaf_dump
select
   memberID         ,
   nameFirst        ,
   nameLast         ,
   if(address1         = '', NULL, address1         ),
   if(address2         = '', NULL, address2         ),
   if(city             = '', NULL, city             ),
   if(province         = '', NULL, province         ),
   if(country          = '', NULL, country          ),
   if(postalCode       = '', NULL, postalCode       ),
   if(telephone        = '', NULL, telephone        ),
   if(cell             = '', NULL, cell             ),
   if(email            = '', NULL, email            ),
   if(status           = '', NULL, status           ),
   if(master_age       = '', NULL, master_age       ),
   if(master_firstDate = '', NULL, master_firstDate ),
   dateAdded,
   case siteCode when '' then null
    when 'Member' then 'member' else siteCode end,
   if(login            = '', NULL, login            ),
   if(password         = '', NULL, password         ),
   case class when '' then 'unknown' when 'amateur' then 'amateurs'
       when 'Amateurs' then 'amateurs' when 'women' then 'womens'
       when 'Masters' then 'masters' when 'n/a' then 'N/A'
       when 'Womens' then 'womens' when 'Open' then 'open'
       when 'Lightweight' then 'lightweight'
       when 'Womensmaster' then 'womensmaster'
       when 'Masters50+' then 'masters'
       when 'Masters60+' then 'masters'
       when 'Womensmaster50+' then 'womensmaster'
       when 'Womensmaster60+' then 'womensmaster'
       when 'Juniors' then 'juniors' else coalesce(class, 'unknown') end,
   if(region           = '', NULL, region           ),
   if(height           = '', NULL, height           ),
   if(weight           = '', NULL, weight           ),
   if(birthDate = '', NULL, birthDate),
   if(tartan          = '', NULL, tartan           ),
   if(biography       = '', NULL, biography        ),
   if(imageFile       = '', NULL, imageFile        ),
   if(gamesList       = '', NULL, gamesList        ),
   if(username        = '', NULL, username         ),
   if(banned_startDate= '', NULL, banned_startDate ),
   if(banned_endDate  = '', NULL, banned_endDate   )
from membership
into outfile '/Users/james/src/csaf/csaf/mysql_members_dump.csv'
 fields terminated by ',' optionally enclosed by '"'
 lines terminated by '\n'
#+end_src

#+RESULTS:
|---|

Importing

#+begin_src sql :engine postgresql :dbhost localhost :dbport 5432 :dbuser tester :dbpassword test :database csaf_dev
begin;
\copy members from '/Users/james/src/csaf/csaf/mysql_members_dump.csv' with (format csv, NULL '\N', quote '"', escape '\');
select setval('members_id_seq', max(id)) from members;
end;
#+end_src

#+RESULTS:
| SET       |
|-----------|
| COPY 1346 |


* Games

Schema is spread over a couple tables

We can change some stuff using enums instead of tables for the classes and events.

Two main separations - ~score_results~ is the real result, but we also have the sheets stored (presumably the process goes from those to the results?)

Do we need to keep the sheets as separate tables?

A lot of denormalization as well

** Step One: Games & Results

#+begin_src sql
-- ----------------------------
-- Table structure for score_games
-- ----------------------------
CREATE TABLE `score_games` (
  `gamesID` int(11) NOT NULL AUTO_INCREMENT,
  `name` varchar(200) DEFAULT NULL,
  `website` varchar(200) DEFAULT NULL,
  `status` varchar(20) NOT NULL DEFAULT 'active' COMMENT 'active,inactive',
  `contactName` varchar(100) DEFAULT NULL,
  `contactEmail` varchar(100) DEFAULT NULL,
  `contactPhone` varchar(20) DEFAULT NULL,
  `spreadsheetName` varchar(50) DEFAULT NULL,
  `city` varchar(100) DEFAULT NULL,
  `province` varchar(100) DEFAULT NULL,
  `region` varchar(100) DEFAULT NULL,
  PRIMARY KEY (`gamesID`)
) ENGINE=MyISAM AUTO_INCREMENT=581 DEFAULT CHARSET=latin1 ROW_FORMAT=DYNAMIC;
#+end_src

#+begin_src sql :engine mysql :dbhost localhost :dbport 3306 :dbuser root :dbpassword foobar :database csaf_dump
select
  gamesID,
  name,
  website,
  status,
  contactName,
  contactEmail,
  contactPhone,
  city,
  province,
  region
from score_games
into outfile '/Users/james/src/csaf/csaf/mysql_games_dump.csv'
 fields terminated by ',' optionally enclosed by '"'
 lines terminated by '\n'
#+end_src

#+RESULTS:
|---|

#+begin_src sql :engine postgresql :dbhost localhost :dbport 5432 :dbuser tester :dbpassword test :database csaf_dev
begin;
\copy games from '/Users/james/src/csaf/csaf/mysql_games_dump.csv' with (format csv, NULL '\N', quote '"', escape '\');
select setval('games_id_seq', max(id)) from games;
end;
#+end_src

#+RESULTS:
| SET      |
|----------|
| BEGIN    |
| COPY 347 |
| setval   |
| 580      |
| COMMIT   |

#+begin_src sql
-- ----------------------------
-- Table structure for score_dates
-- ----------------------------
CREATE TABLE `score_dates` (
  `dateID` int(11) NOT NULL AUTO_INCREMENT,
  `gamesID` int(11) DEFAULT NULL,
  `eventDate` varchar(20) DEFAULT NULL,
  `eventList` varchar(200) DEFAULT NULL,
  PRIMARY KEY (`dateID`),
  KEY `gamesIX` (`gamesID`),
  KEY `evntDate` (`eventDate`)
) ENGINE=MyISAM AUTO_INCREMENT=1659 DEFAULT CHARSET=latin1 ROW_FORMAT=DYNAMIC;
#+end_src

#+begin_src sql :engine mysql :dbhost localhost :dbport 3306 :dbuser root :dbpassword foobar :database csaf_dump
select
  dateID,
  gamesID,
  eventDate,
  eventList
from score_dates
into outfile '/Users/james/src/csaf/csaf/mysql_dates_dump.csv'
 fields terminated by ',' optionally enclosed by '"'
 lines terminated by '\n'
#+end_src

#+RESULTS:
|---|

#+begin_src sql :engine postgresql :dbhost localhost :dbport 5432 :dbuser tester :dbpassword test :database csaf_dev
begin;
\copy game_instances from '/Users/james/src/csaf/csaf/mysql_dates_dump.csv' with (format csv, NULL '\N', quote '"', escape '\');
select setval('game_instances_id_seq', max(id)) from game_instances;
end;
#+end_src

#+RESULTS:
| SET       |
|-----------|
| BEGIN     |
| COPY 1113 |
| setval    |
| 580       |
| COMMIT    |

Score results

#+begin_src sql
-- ----------------------------
-- Table structure for score_results
-- ----------------------------
CREATE TABLE `score_results` (
  `rno` int(11) NOT NULL AUTO_INCREMENT,
  `memberID` int(11) NOT NULL DEFAULT '0',
  `eventID` int(11) NOT NULL DEFAULT '0',
  `dateID` int(11) NOT NULL DEFAULT '0',
  `distance` float NOT NULL DEFAULT '0',
  `distance_feet` int(11) NOT NULL DEFAULT '0',
  `distance_inches` decimal(11,2) NOT NULL DEFAULT '0.00',
  `clock` float NOT NULL DEFAULT '0',
  `clock_hours` int(11) NOT NULL DEFAULT '0',
  `clock_minutes` int(11) NOT NULL DEFAULT '0',
  `weight` decimal(11,2) NOT NULL DEFAULT '0.00',
  `score` decimal(11,4) NOT NULL DEFAULT '0.0000',
  `class` varchar(20) DEFAULT NULL,
  `date_year` int(11) NOT NULL DEFAULT '0',
  `CanadianRecord` char(1) NOT NULL DEFAULT 'n',
  `old_memberID` int(11) NOT NULL DEFAULT '0',
  `sheet_colID` int(11) NOT NULL DEFAULT '0',
  PRIMARY KEY (`rno`),
  KEY `memberIDIX` (`memberID`),
  KEY `eventIDIX` (`eventID`),
  KEY `gamesIDIX` (`dateID`),
  KEY `yearsIX` (`date_year`),
  KEY `classIX` (`class`)
) ENGINE=MyISAM AUTO_INCREMENT=143736 DEFAULT CHARSET=latin1 ROW_FORMAT=DYNAMIC;
#+end_src

#+begin_src bash
rm '/Users/james/src/csaf/csaf/mysql_results_dump.csv'
#+end_src

#+RESULTS:

#+begin_src sql :engine mysql :dbhost localhost :dbport 3306 :dbuser root :dbpassword foobar :database csaf_dump
select
   rno,
   memberID,
   dateID,
   case eventID when 1 then 'braemar' when 2 then 'open' when 3 then 'wob'
     when 4 then 'hwfd' when 5 then 'lwfd' when 6 then 'lhmr' when 7 then 'hhmr'
     when 8 then 'caber' when 9 then 'sheaf' end,
   distance,
   if(eventID <> 8, NULL, clock_hours * 60 + clock_minutes),
   weight,
   score,
   case class
       when 'Masters50+' then 'masters'
       when 'Masters60+' then 'masters'
       when 'Womensmaster50+' then 'womensmaster'
       when 'Womensmaster60+' then 'womensmaster'
       else lower(class) end
from score_results
into outfile '/Users/james/src/csaf/csaf/mysql_results_dump.csv'
 fields terminated by ',' optionally enclosed by '"'
 lines terminated by '\n'
#+end_src

#+RESULTS:
|---|

#+begin_src sql :engine postgresql :dbhost localhost :dbport 5432 :dbuser tester :dbpassword test :database csaf_dev
insert into members (id, first_name, last_name, login, password_hash, "class")
values
 --(1217, 'Unknown', 'Missing', 'unknownmissinguser', 'newpass', 'unknown'),
 (1122, 'Unknown', 'Missing', 'unknownmissinguser', 'newpass', 'unknown')
;
#+end_src

#+RESULTS:
| SET        |
|------------|
| INSERT 0 1 |

#+begin_src sql :engine postgresql :dbhost localhost :dbport 5432 :dbuser tester :dbpassword test :database csaf_dev
begin;
\copy game_member_results from '/Users/james/src/csaf/csaf/mysql_results_dump.csv' with (format csv, NULL '\N', quote '"', escape '\');
select setval('game_member_results_id_seq', max(id)) from game_member_results;
end;
#+end_src

#+RESULTS:
| SET        |
|------------|
| BEGIN      |
| COPY 84432 |
| setval     |
| 143735     |
| COMMIT     |

** Placings

#+begin_src sql :engine mysql :dbhost localhost :dbport 3306 :dbuser root :dbpassword foobar :database csaf_dump
describe score_placings;
#+end_src

#+RESULTS:
| Field           | Type        | Null | Key | Default | Extra          |
|-----------------+-------------+------+-----+---------+----------------|
| placeID         | int         | NO   | PRI |    NULL | auto_increment |
| memberID        | int         | NO   | MUL |       0 |                |
| dateID          | int         | NO   |     |       0 |                |
| competitionDate | varchar(20) | YES  |     |    NULL |                |
| placing         | int         | NO   |     |       0 |                |
| class           | varchar(50) | YES  |     |    NULL |                |
| date_year       | int         | NO   | MUL |       0 |                |


#+begin_src bash
rm '/Users/james/src/csaf/csaf/mysql_placings_dump.csv'
#+end_src

#+RESULTS:

#+begin_src sql :engine mysql :dbhost localhost :dbport 3306 :dbuser root :dbpassword foobar :database csaf_dump
select
   memberID,
   dateID,
   min(placing),
   case class
       when 'Masters50+' then 'masters'
       when 'Masters60+' then 'masters'
       when 'Womensmaster50+' then 'womensmaster'
       when 'Womensmaster60+' then 'womensmaster'
       else lower(coalesce(class, 'unknown')) end
from score_placings
where placing > 0 -- only 107 where this is the case - what does that mean?
  and dateID <> 0 -- dunno what this is
group by memberID, dateID, class
into outfile '/Users/james/src/csaf/csaf/mysql_placings_dump.csv'
 fields terminated by ',' optionally enclosed by '"'
 lines terminated by '\n'
#+end_src

#+RESULTS:
|---|

#+begin_src sql :engine postgresql :dbhost localhost :dbport 5432 :dbuser tester :dbpassword test :database csaf_dev
\copy game_results_placing from '/Users/james/src/csaf/csaf/mysql_placings_dump.csv' with (format csv, NULL '\N', quote '"', escape '\');
#+end_src

#+RESULTS:
| SET        |
|------------|
| COPY 10362 |

#+begin_src sql :engine mysql :dbhost localhost :dbport 3306 :dbuser root :dbpassword foobar :database csaf_dump
describe score_sheet_main
#+end_src

#+RESULTS:
| Field        | Type         | Null | Key | Default           | Extra             |
|--------------+--------------+------+-----+-------------------+-------------------|
| sheet_main   | int          | NO   | PRI | NULL              | auto_increment    |
| status       | varchar(30)  | NO   |     | pending           |                   |
| gamesID      | int          | NO   |     | 0                 |                   |
| games_year   | int          | NO   |     | 0                 |                   |
| games_date   | varchar(20)  | YES  |     | NULL              |                   |
| file_name    | varchar(100) | YES  |     | NULL              |                   |
| add_date     | timestamp    | NO   |     | CURRENT_TIMESTAMP | DEFAULT_GENERATED |
| submitted_by | varchar(50)  | YES  |     | NULL              |                   |
| event_list   | varchar(200) | YES  |     | NULL              |                   |
| weight_list  | varchar(200) | YES  |     | NULL              |                   |
| length_list  | varchar(200) | YES  |     | NULL              |                   |

#+begin_src sql :engine mysql :dbhost localhost :dbport 3306 :dbuser root :dbpassword foobar :database csaf_dump
select distinct status from score_sheet_main
#+end_src

#+RESULTS:
| status   |
|----------|
| complete |
| pending  |


* Records


#+begin_src sql :engine mysql :dbhost localhost :dbport 3306 :dbuser root :dbpassword foobar :database csaf_dump
describe score_records
#+end_src

#+RESULTS:
| Field         | Type         | Null | Key | Default           | Extra                                         |
|---------------+--------------+------+-----+-------------------+-----------------------------------------------|
| rno           | int          | NO   | PRI | NULL              | auto_increment                                |
| Type          | varchar(50)  | YES  |     | NULL              |                                               |
| Class         | varchar(30)  | YES  |     | NULL              |                                               |
| Event         | varchar(30)  | YES  |     | NULL              |                                               |
| Athlete       | varchar(200) | YES  |     | NULL              |                                               |
| Distance      | float        | YES  |     | NULL              |                                               |
| Weight        | float        | YES  |     | NULL              |                                               |
| Year          | varchar(10)  | YES  |     | NULL              |                                               |
| Comment       | varchar(255) | YES  |     | NULL              |                                               |
| new_athleteid | int          | NO   |     | 0                 |                                               |
| resultID      | int          | NO   |     | 0                 |                                               |
| sheet_main    | int          | NO   |     | 0                 |                                               |
| status        | varchar(20)  | NO   |     | unverified        |                                               |
| displayFlag   | varchar(20)  | YES  |     | no                |                                               |
| userName      | varchar(30)  | YES  |     | NULL              |                                               |
| dateChanged   | timestamp    | YES  |     | CURRENT_TIMESTAMP | DEFAULT_GENERATED on update CURRENT_TIMESTAMP |


#+begin_src sql :engine mysql :dbhost localhost :dbport 3306 :dbuser root :dbpassword foobar :database csaf_dump
select
  rno,
  coalesce(`Type`, '') = 'Canada',
  lower(Class),
  case lower(Event)
  when 'brae' then 'braemar'
  when 'ston' then 'open'
  when 'shf' then 'sheaf'
  else lower(Event) end,
  Athlete,
  Distance,
  Weight,
  Year,
  Comment,
  status,
  displayFlag
from score_records
into outfile '/Users/james/src/csaf/csaf/mysql_records_dump.csv'
 fields terminated by ',' optionally enclosed by '"'
 lines terminated by '\n'
#+end_src

#+RESULTS:
|---|


#+begin_src sql :engine postgresql :dbhost localhost :dbport 5432 :dbuser tester :dbpassword test :database csaf_dev
begin;
\copy event_records from '/Users/james/src/csaf/csaf/mysql_records_dump.csv' with (format csv, NULL '\N', quote '"', escape '\');
select setval('event_records_id_seq', max(id)) from event_records;
end;
#+end_src

#+RESULTS:
| SET      |
|----------|
| BEGIN    |
| COPY 247 |
| setval   |
| 8483     |
| COMMIT   |

#+begin_src sql :engine mysql :dbhost localhost :dbport 3306 :dbuser root :dbpassword foobar :database csaf_dump
select distinct Class from score_records;
#+end_src

#+RESULTS:
| Class       |
|-------------|
| Womens      |
| Masters     |
| Juniors     |
| Open        |
| Lightweight |

#+begin_src sql :engine mysql :dbhost localhost :dbport 3306 :dbuser root :dbpassword foobar :database csaf_dump
select `type`, count(*) from score_records group by `type`;
#+end_src

#+RESULTS:
| type   | count(*) |
|--------+----------|
| Canada |      125 |
| NULL   |       69 |
|        |       53 |

#+begin_src sql :engine mysql :dbhost localhost :dbport 3306 :dbuser root :dbpassword foobar :database csaf_dump
select status, count(*) from score_records group by status;
#+end_src

#+RESULTS:
| status     | count(*) |
|------------+----------|
| verified   |      157 |
| inactive   |        7 |
| unverified |       64 |
| new        |       17 |
| updated    |        2 |

#+begin_src sql :engine mysql :dbhost localhost :dbport 3306 :dbuser root :dbpassword foobar :database csaf_dump
select displayFlag, count(*) from score_records group by displayFlag;
#+end_src

#+RESULTS:
| displayFlag | count(*) |
|-------------+----------|
| no          |      178 |
| yes         |       69 |

#+begin_src sql :engine mysql :dbhost localhost :dbport 3306 :dbuser root :dbpassword foobar :database csaf_dump
select Athlete from score_records limit 10;
#+end_src

#+RESULTS:
| Athlete            |
|--------------------|
| Patterson, Mikaela |
| Trask, Warren      |
| Harris, Andrew     |
| Bishop, Dirk       |
| Bishop, Dirk       |
| Goldthorp, Joshua  |
| Markovic, Dan      |
| Pauletto, Nicolas  |
| Doherty, Matt      |
| Hadley, Greg       |

#+begin_src sql :engine mysql :dbhost localhost :dbport 3306 :dbuser root :dbpassword foobar :database csaf_dump
describe score_records_suggested
#+end_src

#+RESULTS:
| Field       | Type         | Null | Key | Default           | Extra                                         |
|-------------+--------------+------+-----+-------------------+-----------------------------------------------|
| rno         | int          | NO   | PRI | NULL              | auto_increment                                |
| type        | varchar(50)  | YES  |     | NULL              |                                               |
| class       | varchar(30)  | YES  |     | NULL              |                                               |
| event       | varchar(30)  | YES  |     | NULL              |                                               |
| athlete     | varchar(200) | YES  |     | NULL              |                                               |
| distance    | float        | YES  |     | NULL              |                                               |
| weight      | float        | YES  |     | NULL              |                                               |
| year        | varchar(10)  | YES  |     | NULL              |                                               |
| status      | varchar(20)  | YES  |     | new               |                                               |
| displayFlag | varchar(20)  | YES  |     | no                |                                               |
| games       | varchar(200) | YES  |     | NULL              |                                               |
| userName    | varchar(30)  | YES  |     | NULL              |                                               |
| dateAdded   | timestamp    | YES  |     | CURRENT_TIMESTAMP | DEFAULT_GENERATED on update CURRENT_TIMESTAMP |

#+begin_src sql :engine mysql :dbhost localhost :dbport 3306 :dbuser root :dbpassword foobar :database csaf_dump
select count(*) from score_records_suggested
#+end_src

#+RESULTS:
| count(*) |
|----------|
|        4 |

#+begin_src sql :engine mysql :dbhost localhost :dbport 3306 :dbuser root :dbpassword foobar :database csaf_dump
select distinct class
from score_placings
#+end_src

#+RESULTS:
| class           |
|-----------------|
| NULL            |
| Open            |
| Womens          |
| Amateurs        |
| Masters         |
| Juniors         |
| Lightweight     |
| Womensmaster    |
| Masters50+      |
| Masters60+      |
| Womensmaster50+ |
| Womensmaster60+ |

#+begin_src sql :engine mysql :dbhost localhost :dbport 3306 :dbuser root :dbpassword foobar :database csaf_dump
select eventName, classStandard from score_events
#+end_src

#+RESULTS:
| eventName                 | classStandard                                                                                                         |
|---------------------------+-----------------------------------------------------------------------------------------------------------------------|
| Braemar Stone             | WomensMaster:36'9-12,WomensMaster50+:26'1.5-12,WomensMaster60+:23'1-12,Masters50+:43'6.5-22,Masters60+:40'0.5-16      |
| Open Stone                | WomensMaster:47'7-8,WomensMaster50+:33'5.5-8,WomensMaster60+:30'3-8,Masters50+:49'7-16,Masters60+:40'0.5-16           |
| Weight Over Bar           | WomensMaster:17'6-28,WomensMaster50+:18'3-21,WomensMaster60+:18'6-14,Master50+:20'1-42,Master60+:17'3-35\n          |
| Heavy Weight for Distance | WomensMaster:42'7-28,WomensMaster50+:51'5-21,WomensMaster60+:51'11.5-14,Masters50+:56'10-42,Masters60+:42'1-35        |
| Light Weight for Distance | WomensMaster:85'2.5-14,WomensMaster50+:66'3-14,WomensMaster60+:68'-9,Masters50+:79'11-28,Masters60+:63'6-21           |
| Light Hammer              | WomensMaster:100'5-12,WomensMaster50+:85'11-12,WomensMaster60+:83'2-8,Masters50+:132'10-16,Masters60+:105'4.5-12      |

| Heavy Hammer              | WomensMaster:85'7.5-16,WomensMaster50+:69'7.5-16,WomensMaster60+:63'8.5-12,Masters50+:99'8.5-16,Masters60+:105'4.5-12 |

| Caber                     |                                                                                                                       |
| Sheaf                     | WomensMaster:34'2-10,WomensMaster50+:29'-10,WomensMaster60+:22'-10,Masters50+:37'6-16,Masters60+:31'-12               |
